##3.22 第一周 Q&A： 课程准备 信息回路
###画马图片
画马， 编程语言看起来很简单，实际上不是这样   

曲不离口，勤练 。一看教程立马就会是不现实的。

###第一周要点
信息回路：交流非常重要
不进行频繁交流，根本不知道学的对不对
![流程图](https://wx.qq.com/cgi-bin/mmwebwx-bin/webwxgetmsgimg?MsgID=1023681432&skey=%40crypt_e9ff960e_6566bf404d33a7bf4068b41f64fa0353&__r=-627476324)
导师的作用同健身教练一样，教练的重要性
那么问题来了，不敢问问题？大妈也经历过不敢问问题的阶段！问题小白？荒谬！
不尝试不知道问问题的正确姿势。
教程再好也跟我们没关系，是作者的个人视角。无论用哪种教程练习，形成的语感都是私人的，没有一致的。
所以，问问题，自古以来的完美方式……邮件列表。
问题不分小白和精深，只有好问题与坏问题，在小白状态看待问题的方式决定发展方向。
###什么是好问题
就是让高手产生兴趣的问题。坏问题的本质：对问题不认真。对问题的认真程度决定回答者的认真程度。
###为什么是邮件列表
- 好处1，生死相关的特征，决定其不可被替代：优雅的异步交流。邮件列表与GITHUB相似，异步推送。实时交流，是pull方式，人不在看不到最新消息，没有信息线索，只有时间线，心智负担过载，低价值。邮件列表，发出问题，等待，得到毫无干扰的认真回答。并不是同一时间同一问题讨论。
- 引用，所有邮件公开，存在时间长，这意味着信誉起作用。
###信息回路
知识螺旋
知识转的越多越快，产生的越多。
微信，习惯性心里慰藉。问题在列表中正式沟通，问题由任务而来。接到任务大家自行分解。然后，所有的任务都有产出——教程。教大妈。通过github放出。产生困难，与导师接触。第一时间统回导师。

- 第一阶段 前两周，形成高效优雅的技术交流方式
- 第二阶段 第三周开始，MIT公开课闯关

##核心思想：

###高效快速自然兼容多种习惯的信息链。
（附带好处，积累的教程、问题、中间代码，都在为世界非计算机专业python最好教材提供素材。）
###技术环境顺畅起来。
github发布出来，有互联网唯一url，“岩钉”。（根据岩钉打分。评分标准：本人成长快慢，对其他人贡献。）
48小时内完成任务，发布。立刻将任务变成“岩钉”。
##任务
27日前，必须完成阶段作业。（新增技能：1.git 2.github 3.gitbook 4.python环境 以及相关知识点，掌握到够用：能教会六个月前的自己。）
###补充
学习时间：每周10小时，每天1小时，周末每天两小时。
